<?php
// 指定账户密码
$accounts = array(
    "1" => "11",
    "2" => "12",
    "3" => "13",
    "4" => "14",
    "5" => "15",
    "6" => "16",
    "7" => "17",
    "8" => "18",
    "9" => "19",
    "10" => "20",
    "11" => "21",
    "12" => "22",
    "13" => "23",
    "14" => "24",
    "15" => "25",
    "16" => "26",
    "17" => "27",
    "18" => "28",
    "19" => "29",
    "20" => "30",
    "21" => "31",
    "22" => "32",
    "23" => "33",
    "24" => "34",
    "25" => "11",
    "26" => "12",
    "27" => "13",
    "28" => "14",
    "29" => "15",
    "30" => "16",
    "31" => "17",
    "32" => "18",
    "33" => "19",
    "34" => "20"
);

if ($_SERVER["REQUEST_METHOD"] == "POST") {
    $username = $_POST["username"];
    $password = $_POST["password"];

    if (isset($accounts[$username]) && $accounts[$username] == $password) {
// 登录成功，跳转到主页
        header("Location: index.php");
        exit;
    } else {
// 登录失败，显示错误信息
        echo "<p>Invalid username or password.";}